In [1]:
import numpy as np
import pandas as pd
from sklearn import model_selection
from sklearn.linear_model import LogisticRegression

In [2]:
2+2

4

In [3]:
df=pd.read_csv('0000000000002429_training_titanic_x_y_train.csv',delimiter=',')

In [4]:
dftest=pd.read_csv('0000000000002429_test_titanic_x_test.csv',delimiter=',')
dftest.isnull().sum()

Pclass        0
Name          0
Sex           0
Age          45
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       173
Embarked      1
dtype: int64

In [5]:
df.head(2)

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.00,NaN,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.05,NaN,S,0

In [6]:
df.isnull().sum()

Pclass        0
Name          0
Sex           0
Age         132
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       514
Embarked      1
Survived      0
dtype: int64

In [7]:
df.drop('Cabin',axis=1,inplace=True)
dftest.drop('Cabin',axis=1,inplace=True)

In [8]:
df.head(2)

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.00,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.05,S,0

In [9]:
del df['Name']
del dftest['Name']

In [10]:
del df['Ticket']
del dftest['Ticket']

In [11]:
df.head(2)

   Pclass     Sex   Age  SibSp  Parch   Fare Embarked  Survived
0       2  female  29.0      1      0  26.00        S         1
1       3    male   NaN      0      0   8.05        S         0

In [12]:
df.describe()

           Pclass         Age       SibSp       Parch        Fare    Survived
count  668.000000  536.000000  668.000000  668.000000  668.000000  668.000000
mean     2.296407   29.700560    0.528443    0.407186   32.064552    0.402695
std      0.831638   14.240257    1.080327    0.854695   45.320835    0.490808
min      1.000000    0.670000    0.000000    0.000000    0.000000    0.000000
25%      2.000000   21.000000    0.000000    0.000000    7.925000    0.000000
50%      3.000000   29.000000    0.000000    0.000000   14.750000    0.000000
75%      3.000000   38.250000    1.000000    0.000000   31.275000    1.000000
max      3.000000   80.000000    8.000000    6.000000  512.329200    1.000000

In [13]:
del df['Fare']
del dftest['Fare']

In [14]:
df.head()

   Pclass     Sex   Age  SibSp  Parch Embarked  Survived
0       2  female  29.0      1      0        S         1
1       3    male   NaN      0      0        S         0
2       2    male  39.0      0      0        S         0
3       3  female  29.0      0      4        S         0
4       3    male  25.0      0      0        S         0

In [15]:
df.isnull().sum()

Pclass        0
Sex           0
Age         132
SibSp         0
Parch         0
Embarked      1
Survived      0
dtype: int64

In [16]:
df=df[df['Embarked'].isnull()==False]
#dftest=dftest[dftest['Embarked'].isnull()==False]

In [17]:
df['Embarked'].fillna('C',inplace=True)

In [18]:
df.isnull().sum()

Pclass        0
Sex           0
Age         132
SibSp         0
Parch         0
Embarked      0
Survived      0
dtype: int64

In [19]:
dftest.isnull().sum()

Pclass       0
Sex          0
Age         45
SibSp        0
Parch        0
Embarked     1
dtype: int64

In [20]:
meanSurvived=df[df['Survived']==1]['Age'].mean()
meanSurvived

28.094713656387665

In [21]:
df['age2']=np.where(pd.isnull(df['Age']) & df['Survived']==1,meanSurvived,df['Age'])

In [22]:
meanNotSurvived=df[df['Survived']==0]['Age'].mean()
meanNotSurvived

30.857142857142858

In [23]:
df['age2'].fillna(meanNotSurvived,inplace=True)

In [24]:
del df['Age']

In [25]:
df.isnull().sum()

Pclass      0
Sex         0
SibSp       0
Parch       0
Embarked    0
Survived    0
age2        0
dtype: int64

In [26]:
df.head()

   Pclass     Sex  SibSp  Parch Embarked  Survived       age2
0       2  female      1      0        S         1  29.000000
1       3    male      0      0        S         0  30.857143
2       2    male      0      0        S         0  39.000000
3       3  female      0      4        S         0  29.000000
4       3    male      0      0        S         0  25.000000

In [27]:
def strtonum(s):
    if s=='C':
        return 0
    elif s=='Q':
        return 1
    else:
        return 2

In [28]:
df['Embarked']=df['Embarked'].apply(strtonum)

dftest['Embarked']=dftest['Embarked'].apply(strtonum)


df.head()

   Pclass     Sex  SibSp  Parch  Embarked  Survived       age2
0       2  female      1      0         2         1  29.000000
1       3    male      0      0         2         0  30.857143
2       2    male      0      0         2         0  39.000000
3       3  female      0      4         2         0  29.000000
4       3    male      0      0         2         0  25.000000

In [29]:
def strtonum2(s):
    if s=='female':
        return 1
    else:
        return 0

In [30]:
df['Sex']=df['Sex'].apply(strtonum2)

dftest['Sex']=dftest['Sex'].apply(strtonum2)

df.head()

   Pclass  Sex  SibSp  Parch  Embarked  Survived       age2
0       2    1      1      0         2         1  29.000000
1       3    0      0      0         2         0  30.857143
2       2    0      0      0         2         0  39.000000
3       3    1      0      4         2         0  29.000000
4       3    0      0      0         2         0  25.000000

In [31]:
dfop=df['Survived']
dfip=df.drop('Survived',axis=1)

In [32]:
tmeanMale=dftest[dftest['Sex']==0]['Age'].mean()
tmeanMale

30.694237288135593

In [33]:
dftest['age2']=np.where(pd.isnull(dftest['Age']) & dftest['Sex']==1,tmeanMale,dftest['Age'])

In [34]:
tmeanfeMale=dftest[dftest['Sex']==1]['Age'].mean()
tmeanfeMale

27.729166666666668

In [35]:
dftest['age2'].fillna(tmeanfeMale,inplace=True)

In [36]:
del dftest['Age']

In [47]:
algo=LogisticRegression(solver='saga')

In [48]:
# complex boundaries
di=dfip.copy()
Li=dfip.columns
for s in Li:
    for s2 in Li:
        if (s+'_'+s2 not in di.columns) and (s2+'_'+s not in di.columns):
            di[s+'_'+s2]=di[s]*di[s2]
            dftest[s+'_'+s2]=dftest[s]*di[s2]

    
print(dfip.shape)
print(di.shape)
print(dftest.shape)
print(dfop.shape)

(667, 6)
(667, 27)
(223, 27)
(667,)

In [49]:
x=di.values
y=dfop.values

In [50]:
x_test=dftest.values
x_test.shape

(223, 27)

In [51]:
# feature scaling
#from sklearn import preprocessing
#fs=preprocessing.StandardScaler()
#fs.fit_transform(x,y)
#fs.transform(x_test)

In [52]:
algo.fit(x,y)

C:\anaconda\lib\site-packages\sklearn\linear_model\sag.py:326: ConvergenceWarning: The max_iter was reached which means the coef_ did not converge
  "the coef_ did not converge", ConvergenceWarning)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l2', random_state=None, solver='saga', tol=0.0001,
          verbose=0, warm_start=False)

In [53]:
y_pred=algo.predict(x_test)
y_pred.shape

(223,)

In [54]:
algo.predict_proba(x)

array([[0.57861386, 0.42138614],
       [0.73220581, 0.26779419],
       [0.68782007, 0.31217993],
       ...,
       [0.73791218, 0.26208782],
       [0.62599567, 0.37400433],
       [0.6247679 , 0.3752321 ]])

In [55]:
np.savetxt('LogisticRegressionTitanicDataset.csv',y_pred,delimiter=',',fmt='%d')

In [56]:
dftest.isnull().sum()

Pclass               0
Sex                  0
SibSp                0
Parch                0
Embarked             0
age2                 0
Pclass_Pclass        0
Pclass_Sex           0
Pclass_SibSp         0
Pclass_Parch         0
Pclass_Embarked      0
Pclass_age2          0
Sex_Sex              0
Sex_SibSp            0
Sex_Parch            0
Sex_Embarked         0
Sex_age2             0
SibSp_SibSp          0
SibSp_Parch          0
SibSp_Embarked       0
SibSp_age2           0
Parch_Parch          0
Parch_Embarked       0
Parch_age2           0
Embarked_Embarked    0
Embarked_age2        0
age2_age2            0
dtype: int64